{
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ace",
    "1": "afr",
    "2": "als",
    "3": "amh",
    "4": "ang",
    "5": "ara",
    "6": "arg",
    "7": "arz",
    "8": "asm",
    "9": "ast",
    "10": "ava",
    "11": "aym",
    "12": "azb",
    "13": "aze",
    "14": "bak",
    "15": "bar",
    "16": "bcl",
    "17": "be-tarask",
    "18": "bel",
    "19": "ben",
    "20": "bho",
    "21": "bjn",
    "22": "bod",
    "23": "bos",
    "24": "bpy",
    "25": "bre",
    "26": "bul",
    "27": "bxr",
    "28": "cat",
    "29": "cbk",
    "30": "cdo",
    "31": "ceb",
    "32": "ces",
    "33": "che",
    "34": "chr",
    "35": "chv",
    "36": "ckb",
    "37": "cor",
    "38": "cos",
    "39": "crh",
    "40": "csb",
    "41": "cym",
    "42": "dan",
    "43": "deu",
    "44": "diq",
    "45": "div",
    "46": "dsb",
    "47": "dty",
    "48": "egl",
    "49": "ell",
    "50": "eng",
    "51": "epo",
    "52": "est",
    "53": "eus",
    "54": "ext",
    "55": "fao",
    "56": "fas",
    "57": "fin",
    "58": "fra",
    "59": "frp",
    "60": "fry",
    "61": "fur",
    "62": "gag",
    "63": "gla",
    "64": "gle",
    "65": "glg",
    "66": "glk",
    "67": "glv",
    "68": "grn",
    "69": "guj",
    "70": "hak",
    "71": "hat",
    "72": "hau",
    "73": "hbs",
    "74": "heb",
    "75": "hif",
    "76": "hin",
    "77": "hrv",
    "78": "hsb",
    "79": "hun",
    "80": "hye",
    "81": "ibo",
    "82": "ido",
    "83": "ile",
    "84": "ilo",
    "85": "ina",
    "86": "ind",
    "87": "isl",
    "88": "ita",
    "89": "jam",
    "90": "jav",
    "91": "jbo",
    "92": "jpn",
    "93": "kaa",
    "94": "kab",
    "95": "kan",
    "96": "kat",
    "97": "kaz",
    "98": "kbd",
    "99": "khm",
    "100": "kin",
    "101": "kir",
    "102": "koi",
    "103": "kok",
    "104": "kom",
    "105": "kor",
    "106": "krc",
    "107": "ksh",
    "108": "kur",
    "109": "lad",
    "110": "lao",
    "111": "lat",
    "112": "lav",
    "113": "lez",
    "114": "lij",
    "115": "lim",
    "116": "lin",
    "117": "lit",
    "118": "lmo",
    "119": "lrc",
    "120": "ltg",
    "121": "ltz",
    "122": "lug",
    "123": "lzh",
    "124": "mai",
    "125": "mal",
    "126": "map-bms",
    "127": "mar",
    "128": "mdf",
    "129": "mhr",
    "130": "min",
    "131": "mkd",
    "132": "mlg",
    "133": "mlt",
    "134": "mon",
    "135": "mri",
    "136": "mrj",
    "137": "msa",
    "138": "mwl",
    "139": "mya",
    "140": "myv",
    "141": "mzn",
    "142": "nan",
    "143": "nap",
    "144": "nav",
    "145": "nci",
    "146": "nds",
    "147": "nds-nl",
    "148": "nep",
    "149": "new",
    "150": "nld",
    "151": "nno",
    "152": "nob",
    "153": "nrm",
    "154": "nso",
    "155": "oci",
    "156": "olo",
    "157": "ori",
    "158": "orm",
    "159": "oss",
    "160": "pag",
    "161": "pam",
    "162": "pan",
    "163": "pap",
    "164": "pcd",
    "165": "pdc",
    "166": "pfl",
    "167": "pnb",
    "168": "pol",
    "169": "por",
    "170": "pus",
    "171": "que",
    "172": "roa-tara",
    "173": "roh",
    "174": "ron",
    "175": "rue",
    "176": "rup",
    "177": "rus",
    "178": "sah",
    "179": "san",
    "180": "scn",
    "181": "sco",
    "182": "sgs",
    "183": "sin",
    "184": "slk",
    "185": "slv",
    "186": "sme",
    "187": "sna",
    "188": "snd",
    "189": "som",
    "190": "spa",
    "191": "sqi",
    "192": "srd",
    "193": "srn",
    "194": "srp",
    "195": "stq",
    "196": "sun",
    "197": "swa",
    "198": "swe",
    "199": "szl",
    "200": "tam",
    "201": "tat",
    "202": "tcy",
    "203": "tel",
    "204": "tet",
    "205": "tgk",
    "206": "tgl",
    "207": "tha",
    "208": "ton",
    "209": "tsn",
    "210": "tuk",
    "211": "tur",
    "212": "tyv",
    "213": "udm",
    "214": "uig",
    "215": "ukr",
    "216": "urd",
    "217": "uzb",
    "218": "vec",
    "219": "vep",
    "220": "vie",
    "221": "vls",
    "222": "vol",
    "223": "vro",
    "224": "war",
    "225": "wln",
    "226": "wol",
    "227": "wuu",
    "228": "xho",
    "229": "xmf",
    "230": "yid",
    "231": "yor",
    "232": "zea",
    "233": "zh-yue",
    "234": "zho"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ace": 0,
    "afr": 1,
    "als": 2,
    "amh": 3,
    "ang": 4,
    "ara": 5,
    "arg": 6,
    "arz": 7,
    "asm": 8,
    "ast": 9,
    "ava": 10,
    "aym": 11,
    "azb": 12,
    "aze": 13,
    "bak": 14,
    "bar": 15,
    "bcl": 16,
    "be-tarask": 17,
    "bel": 18,
    "ben": 19,
    "bho": 20,
    "bjn": 21,
    "bod": 22,
    "bos": 23,
    "bpy": 24,
    "bre": 25,
    "bul": 26,
    "bxr": 27,
    "cat": 28,
    "cbk": 29,
    "cdo": 30,
    "ceb": 31,
    "ces": 32,
    "che": 33,
    "chr": 34,
    "chv": 35,
    "ckb": 36,
    "cor": 37,
    "cos": 38,
    "crh": 39,
    "csb": 40,
    "cym": 41,
    "dan": 42,
    "deu": 43,
    "diq": 44,
    "div": 45,
    "dsb": 46,
    "dty": 47,
    "egl": 48,
    "ell": 49,
    "eng": 50,
    "epo": 51,
    "est": 52,
    "eus": 53,
    "ext": 54,
    "fao": 55,
    "fas": 56,
    "fin": 57,
    "fra": 58,
    "frp": 59,
    "fry": 60,
    "fur": 61,
    "gag": 62,
    "gla": 63,
    "gle": 64,
    "glg": 65,
    "glk": 66,
    "glv": 67,
    "grn": 68,
    "guj": 69,
    "hak": 70,
    "hat": 71,
    "hau": 72,
    "hbs": 73,
    "heb": 74,
    "hif": 75,
    "hin": 76,
    "hrv": 77,
    "hsb": 78,
    "hun": 79,
    "hye": 80,
    "ibo": 81,
    "ido": 82,
    "ile": 83,
    "ilo": 84,
    "ina": 85,
    "ind": 86,
    "isl": 87,
    "ita": 88,
    "jam": 89,
    "jav": 90,
    "jbo": 91,
    "jpn": 92,
    "kaa": 93,
    "kab": 94,
    "kan": 95,
    "kat": 96,
    "kaz": 97,
    "kbd": 98,
    "khm": 99,
    "kin": 100,
    "kir": 101,
    "koi": 102,
    "kok": 103,
    "kom": 104,
    "kor": 105,
    "krc": 106,
    "ksh": 107,
    "kur": 108,
    "lad": 109,
    "lao": 110,
    "lat": 111,
    "lav": 112,
    "lez": 113,
    "lij": 114,
    "lim": 115,
    "lin": 116,
    "lit": 117,
    "lmo": 118,
    "lrc": 119,
    "ltg": 120,
    "ltz": 121,
    "lug": 122,
    "lzh": 123,
    "mai": 124,
    "mal": 125,
    "map-bms": 126,
    "mar": 127,
    "mdf": 128,
    "mhr": 129,
    "min": 130,
    "mkd": 131,
    "mlg": 132,
    "mlt": 133,
    "mon": 134,
    "mri": 135,
    "mrj": 136,
    "msa": 137,
    "mwl": 138,
    "mya": 139,
    "myv": 140,
    "mzn": 141,
    "nan": 142,
    "nap": 143,
    "nav": 144,
    "nci": 145,
    "nds": 146,
    "nds-nl": 147,
    "nep": 148,
    "new": 149,
    "nld": 150,
    "nno": 151,
    "nob": 152,
    "nrm": 153,
    "nso": 154,
    "oci": 155,
    "olo": 156,
    "ori": 157,
    "orm": 158,
    "oss": 159,
    "pag": 160,
    "pam": 161,
    "pan": 162,
    "pap": 163,
    "pcd": 164,
    "pdc": 165,
    "pfl": 166,
    "pnb": 167,
    "pol": 168,
    "por": 169,
    "pus": 170,
    "que": 171,
    "roa-tara": 172,
    "roh": 173,
    "ron": 174,
    "rue": 175,
    "rup": 176,
    "rus": 177,
    "sah": 178,
    "san": 179,
    "scn": 180,
    "sco": 181,
    "sgs": 182,
    "sin": 183,
    "slk": 184,
    "slv": 185,
    "sme": 186,
    "sna": 187,
    "snd": 188,
    "som": 189,
    "spa": 190,
    "sqi": 191,
    "srd": 192,
    "srn": 193,
    "srp": 194,
    "stq": 195,
    "sun": 196,
    "swa": 197,
    "swe": 198,
    "szl": 199,
    "tam": 200,
    "tat": 201,
    "tcy": 202,
    "tel": 203,
    "tet": 204,
    "tgk": 205,
    "tgl": 206,
    "tha": 207,
    "ton": 208,
    "tsn": 209,
    "tuk": 210,
    "tur": 211,
    "tyv": 212,
    "udm": 213,
    "uig": 214,
    "ukr": 215,
    "urd": 216,
    "uzb": 217,
    "vec": 218,
    "vep": 219,
    "vie": 220,
    "vls": 221,
    "vol": 222,
    "vro": 223,
    "war": 224,
    "wln": 225,
    "wol": 226,
    "wuu": 227,
    "xho": 228,
    "xmf": 229,
    "yid": 230,
    "yor": 231,
    "zea": 232,
    "zh-yue": 233,
    "zho": 234
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.53.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
